"""Funções"""

def tela_inicio():
    outstr="""
🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂶 🃍 

        ⠀⠀⠀⠀⠀⠀⠀⠀⢀⡄⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⣀⠤⠒⠉⠉⠉⠣⢄⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⢀⠎⠠⠒⠒⢄⡄⠒⠒⡄⢧⠀⠀⠀⠀⠀⠀⠀
        ⠀⡔⡭⣝⠀⣧⣤⡄⠀⠀⣴⣦⣼⢸⡾⢿⡆⠀⠀⠀⠀    ░░█ █▀█ █▀▀ █▀█  █▀▄ █▀█
        ⠀⠱⣣⣇⠔⠻⠿⠳⣎⡱⠙⠾⠙⠆⣽⡫⠃⠀⠀⠀     █▄█ █▄█ █▄█ █▄█  █▄▀ █▄█
        ⠀⠀⠀⢫⣄⠀⢒⢀⣤⣤⣲⠂⢀⡧⠋⠀⠀⠀⠀⠀⠀    
        ⠀⠀⠀⢀⠝⠓⠠⢅⣒⣲⠇⠒⠉⢣⠀⠀⠀⠀⠊⠁⢆         █▀▄▀█ █ █▀▀ █▀█
        ⠀⠀⢠⠂⠀⢀⢠⠔⠒⠂⢄⠠⡀⠀⠱⡀⠀⢀⠇⢀⠎         █░▀░█ █ █▄▄ █▄█  
        ⠀⠀⡜⠀⠀⢸⡆⠀⠀⠀⠈⣤⢳⠀⠀⢧⠔⠁⡠⠊⠀         
        ⠀⠀⡇⠀⠀⠘⢇⡀⠀⢀⡠⠛⠚⠄⠀⢸⠔⠊⠀⠀⠀            ♥ ♦ ♣ ♠
        ⠀⠀⡇⠀⢀⣸⢔⠊⠣⠬⠕⡤⣸⡀⠀⢸⠀⠀⠀⠀⠀
        ⢠⢶⠗⠲⠚⠀⢫⢧⠀⢀⡮⡔⠁⠱⠲⢺⣶⡄⠀⠀⠀        
        ⠘⠭⠄⢆⣆⣸⠚⠊⠀⠈⠓⠻⣁⡆⠴⠼⠨⠂⠀         \033[7;37;40m  ▶  \033[m   ᴀᴘᴇʀᴛᴇ ᴇɴᴛᴇʀ ᴘᴀʀᴀ ᴊᴏɢᴀʀ
      
        """
    return outstr

def barra_cartas():
    outstr="\n🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂶 🃍\n"
    return outstr

def play (cor="\033[0;30;47m"):
    outstr=f'''
    {cor}                                                                           \033[m
    {cor}        █▀█ █░░ ▄▀█ █▄█                                                    \033[m
    {cor}        █▀▀ █▄▄ █▀█ ░█░            (ᴀᴘᴇʀᴛᴇ ᴇɴᴛᴇʀ ᴘᴀʀᴀ ᴊᴏɢᴀʀ)               \033[m
    {cor}                                                                           \033[m\n'''

    return outstr

def prox_player (cor="\033[0;30;43m"):
    outstr=f'''
    {cor}                                                                           \033[m
    {cor}        █▀█ █▀█ █▀█ ▀▄▀ █ █▀▄▀█ █▀█   ░░█ █▀█ █▀▀ ▄▀█ █▀▄ █▀█ █▀█          \033[m
    {cor}        █▀▀ █▀▄ █▄█ █░█ █ █░▀░█ █▄█   █▄█ █▄█ █▄█ █▀█ █▄▀ █▄█ █▀▄          \033[m
    {cor}                                                                           \033[m
    {cor}                       (ᴀᴘᴇʀᴛᴇ ᴇɴᴛᴇʀ ᴘᴀʀᴀ ᴊᴏɢᴀʀ)                           \033[m
    {cor}                                                                           \033[m'''

    return outstr

def barra_cartas2():
    outstr="\n🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂭 🂮 🂶 🃍\n\n"
    return outstr

def fim_de_jogo():
    outstr='''
    \033[0;30;47m                                                                           \033[m
    \033[0;30;47m     █▀▀ ▄▀█ █▀▄▀█ █▀▀   █▀█ █░█ █▀▀ █▀█                                   \033[m
    \033[0;30;47m     █▄█ █▀█ █░▀░█ ██▄   █▄█ ▀▄▀ ██▄ █▀▄   (ᴀᴘᴇʀᴛᴇ ᴇɴᴛᴇʀ ᴘᴀʀᴀ ᴠᴇʀ o ᴍɪᴄᴏ)  \033[m
    \033[0;30;47m                                                                           \033[m'''

    return outstr

def is_int(string):
    try: 
        int(string)
        return True
    except ValueError:
        return False
